# TextRange Properties

---
The TextRange type exposes the following members.
| Name| Description
---|---|---
| End|  The index of the first character after the end of the range
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Length|  The length of the range.
| Start|  The start index of a range within the FormattedText.
Top
#### Reference
TextRange Class
Autodesk.Revit.DB Namespace